from template import generate

name = 'i_krilya_est_da_letet_nekuda'
data = """\
[[['Настя'],
  ['Настя', 'Неизвестный', 'Чернуха'],
  ['Настя', 'Чернуха'],
  ['Настя'],
  ['Настя', 'Неизвестный'],
  ['Настя'],
  ['Настя', 'Смирновский'],
  ['Настя', 'Смирновский', 'Неизвестный']],
 [['Барон'],
  ['Барон', 'Камердинер'],
  ['Барон'],
  ['Барон', 'Смирновский'],
  ['Барон', 'Баронесса'],
  ['Баронесса'],
  ['Барон', 'Баронесса', 'Смирновский']],
 [['Барон', 'Климович'],
  ['Климович', 'Барон', 'Баронесса'],
  ['Баронесса'],
  ['Барон', 'Баронесса', 'Настя'],
  ['Барон', 'Баронесса', 'Настя', 'Смирновский', 'Слуга'],
  ['Смирновский', 'Настя'],
  ['Барон', 'Баронесса', 'Настя', 'Смирновский'],
  ['Баронесса', 'Смирновский']],
 [['Петрович', 'Елисей'],
  ['Смирновский', 'Петрович', 'Елисей'],
  ['Смирновский'],
  ['Смирновский', 'Чернуха'],
  ['Смирновский'],
  ['Смирновский', 'Баронесса', 'Климович'],
  ['Смирновский', 'Баронесса']],
 [['Настя', 'Чернуха'],
  ['Настя', 'Чернуха', 'Смирновский'],
  ['Настя', 'Чернуха', 'Смирновский', 'Горничная'],
  ['Смирновский'],
  ['Барон', 'Чернуха'],
  ['Барон', 'Чернуха', 'Смирновский', 'Настя'],
  ['Баронесса', 'Барон', 'Чернуха', 'Смирновский', 'Настя']]]
"""

generate(name, data)