from template import generate

name = 'izza_deneg'
data = """\
[[['Кустова', 'Адель', 'Ростин'],
  ['Кустова', 'Адель', 'Ростин', 'Катя'],
  ['Кустова', 'Чепелев', 'Катя'],
  ['Кустова', 'Чепелев', 'Катя', 'Адель'],
  ['Кустова', 'Чепелев', 'Катя', 'Адель', 'Фёдор', 'Ростин']],
 [['Геосиманский', 'Елена', 'Багрецов', 'Иван', 'Чепелев', 'Адольф', 'Кратов', 'Копытов', 'Матрена Викторовна', 'Лидия'],
  ['Елена', 'Багрецов', 'Иван', 'Чепелев', 'Адольф', 'Матрена Викторовна'],
  ['Елена', 'Багрецов', 'Иван', 'Чепелев', 'Адольф', 'Матрена Викторовна', 'Геосиманский'],
  ['Елена', 'Багрецов', 'Иван', 'Чепелев', 'Адольф', 'Матрена Викторовна', 'Геосиманский', 'Лев'],
  ['Елена', 'Багрецов', 'Иван', 'Чепелев', 'Адольф', 'Матрена Викторовна', 'Геосиманский', 'Лев'],
  ['Елена'],
  ['Елена', 'Геосиманский']],
 [['Савелий', 'Катя'],
  ['Кустова', 'Адель', 'Савелий', 'Катя'],
  ['Кустова', 'Терешина'],
  ['Кустова', 'Терешина', 'Адель'],
  ['Адель', 'Кустова'],
  ['Адель', 'Кустова', 'Терешина'],
  ['Адель', 'Кустова', 'Терешина', 'Лев', 'Лакей'],
  ['Кустова', 'Терешина'],
  ['Адель', 'Лев'],
  ['Адель', 'Лев', 'Лакей', 'Багрецов'],
  ['Адель', 'Лев', 'Багрецов', 'Кустова', 'Терешина'],
  ['Адель', 'Багрецов', 'Кустова', 'Терешина'],
  ['Адель', 'Багрецов', 'Кустова', 'Терешина', 'Чепелев']],
 [['Усачев', 'Адольф', 'Кондуктор', 'Семья Усачева', 'Ефим'],
  ['Шелопаи', 'Багрецов'],
  ['Шелопаи', 'Багрецов', 'Елена', 'Лев', 'Терешина', 'Горничная'],
  ['Терешина', 'Ростин', 'Ростин-отец'],
  ['Усачев', 'Адольф', 'Ефим', 'Шелопаи', 'Кустова', 'Савелий'],
  ['Усачев', 'Адольф', 'Ефим', 'Шелопаи', 'Кустова', 'Савелий', 'Елена', 'Лев'],
  ['Усачев', 'Адольф', 'Ефим', 'Шелопаи', 'Кустова', 'Савелий', 'Елена', 'Лев', 'Ростин', 'Ростин-отец'],
  ['Усачев', 'Адольф', 'Ефим', 'Шелопаи', 'Кустова', 'Савелий', 'Елена', 'Лев', 'Ростин', 'Ростин-отец', 'Кратов', 'Лидия', 'Адель', 'Обер-кондуктор'],
  ['Усачев', 'Семья Усачева', 'Адольф', 'Ефим', 'Шелопаи', 'Кустова', 'Савелий', 'Елена', 'Лев', 'Ростин', 'Ростин-отец', 'Кратов', 'Лидия', 'Адель', 'Обер-кондуктор', 'Кондуктор', 'Терешина']]]
"""

generate(name, data)